Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/commissioners_for_oaths.html.txt.tmx
Source language: en
Languages: ga

source: A Commissioner for Oaths is a person who is authorised to verify affidavits, which are statements in writing and on oath, and other legal documents
ga: Duine atá aitheanta le mionnscríbhinní, sin iad ráitis atá tugtha i scríbhinn agus faoi mhionn, agus cáipéisí dleathúla eile a dheimhniú é Coimisinéir Mionn

source: A Commissioner for Oaths is appointed by the Chief Justice and is usually, though not always, a solicitor
ga: Ceapann an Príomh-Bhreitheamh Coimisinéir Mionn agus is iondúil, cé nach i gcónaí, gur dlíodóir é/í

source: Every solicitor holding a current practising certificate is entitled to administer oaths and to use the title "Commissioner for Oaths"
ga: Is féidir le chuile dhlíodóir a bhfuil teastas reatha cleachtaidh aige/aici mionn a chur ar dhuine agus "Coimisinéir Mionn" a thabhairt air/uirthi féin

source: A Commissioner for Oaths may continue to act as a Commissioner for Oaths for as long as he/she remains a solicitor
ga: Is féidir le Coimisinéir Mionn leanúint ag feidhmiú mar Choimisinéir Mionn chomh fada agus a bhíonn sé/sí ag feidhmiú mar dhlíodóir

source: A Commissioner for Oaths who is a:
ga: A Coimisinéir Mionn atá ina:

source: • Solicitor – they cannot use their powers in any proceedings in which they are acting for any of the parties or in which they have an interest
ga: • Aturnae: ní féidir iad a úsáid a gcumhachtaí in aon imeachtaí ina bhfuil siad ag gníomhú ar aon cheann de na páirtithe nó a bhfuil leas acu inti

source: • Non-solicitor – they must not practise outside the area for which they are appointed
ga: • Neamh-aturnae: ní mór dóibh a chleachtadh lasmuigh den limistéar a bhfuil siad ceaptha

source: A Commissioner for Oaths, who is also a Peace Commissioner, must not charge fees for administering oaths or taking declarations or affirmations that they are required by law not to charge for as a Peace Commissioner
ga: Ní caithfidh Coimisinéir Mionnaí táillí as riaradh mhionn nó faoi dhearbhasc dearbhuithe nó ag cur, má tá sé freisin Coimisinéir Síochána, má tá sé ag teastáil de réir an dlí gan táille dóibh mar Coimisinéir Síochána

source: You may need the services of a Commissioner for Oaths if:
ga: D'fhéadfadh sé go mbeadh seirbhísí Choimisinéir Mionn ag teastáil uait dá mbeadh:

source: • you are giving evidence on affidavit for court proceedings in Ireland
ga: • tú le fianaise a thabhairt i mionscríbhinn le haghaidh cás cúirte in Éirinn

source: • you are making an affirmation, declaration, acknowledgement, examination or attestation for the purposes of court proceedings or for the purposes of registration of documents
ga: • dearbhú, ráiteas, admháil, scrúdú nó fianaise dhá dhéanamh nó dhá thabhairt agat ar son cás cúirte nó ar son cáipéisí a chlárú

source: The Functions of a Commissioner for Oaths
ga: Feidhmeanna an Choimisinéir Mionn

source: The essential functions of a Commissioner for Oaths are:
ga: Seo a leanas príomhfheidhmeanna Choimisinéir Mionn:

source: • to make sure that the evidence in question is in written form (the draft affidavit)
ga: • déanamh cinnte go bhfuil an fhianaise chuí tugtha i scríbhinn (dréacht mionscríbhinne)

source: • to establish that the person before him/her has read the draft affidavit and fully understands the contents
ga: • cinntiú go bhfuil an té atá ós a c(h)omhair tar éis dréacht na mionscríbhinne a léamh agus go dtuigeann sé/sí go hiomlán a bhfuil ráite ann

source: • to require the person to swear that the affidavit is true by raising the appropriate Testament in the right hand and repeating the words of the oath
ga: • iarraidh ar an duine a mhionnú go bhfuil an mhionscríbhinn fíor tríd an Tiomna cuí a ardú sa lámh dheas agus focail an mhionna a rá

source: • to verify that the affidavit was properly sworn by completing a "jurat" on the affidavit
ga: • deimhniú gur déanadh an mhionscríbhinn a mhionnú mar is ceart tríd an "dearbhú" ar an mionscríbhinn a shíneadh

source: • to charge a fee for his/her services
ga: • táille a ghearradh ar a c(h)uid seirbhísí

source: A person making an oath will be required to swear the oath by raising the New Testament
ga: Iarrfar ar an té atá ag tógáil mionna é a mhionnú ar an Tiomna Nua

source: A person who is Jewish may swear the oath by raising the Old Testament
ga: Is féidir le Giúdach an mionn a mhionnú ar an Sean Tiomna

source: The oath to be taken by persons before the Commissioner for Oaths is as follows
ga: Seo a leanas an mionn a thógann daoine ós comhair Choimisinéir Mionn

source: "I swear by Almighty God that this is my name and handwriting, and that the contents of this my affidavit are true"
ga: "Dearbhaím faoi Dhia Uilechumhachtach gurb é seo m'ainm agus mo chuid scríbhneoireachta agus go bhfuil na sonraí i mo mhionscríbhinn fíor"

source: A person who objects to being sworn on the grounds that taking an oath is against his/her religious belief or that he/she has no religious belief is permitted to make a solemn affirmation, which is phrased as follows:
ga: Aon duine nach mian leis/léi mionn a thógáil mar gheall go bhfuil sé in aghaidh a c(h)reidimh nó muna bhfuil aon chreideamh aige/aici is féidir leis/léi dearbhú sollúnta a dhéanamh, mar seo a leanas:

source: "I, A.B., do solemnly and sincerely affirm that this is my name and handwriting, and that the contents of this my affidavit are true"
ga: "Dearbhaím, A.B., go sollúnta agus go dílis gurb é seo m'ainm agus mo chuid scríbhneoireachta agus go bhfuil na sonraí i mo mhionscríbhinn fíor"

source: The fees a Commissioner for Oaths can charge are given in the Rules of the Superior Courts (Fees Payable to Commissioners for Oaths) (SI 616 of 2003)
ga: Tugtar na táillí is féidir le Coimisinéir Mionnaí a ghearradh i Rialacha na nUaschúirteanna (Táillí is Iníoctha le Coimisinéirí Mionnaí) (I.R. 616 de 2003)

source: There is a standard fee of €10 euro per signature for verifying statements
ga: Tá táille chaighdeánach €10 euro in aghaidh an tsínithe chun ráitis a fhíordheimhniú

source: If there is an exhibit, for example a marriage certificate, attached to the document that needs to be signed, there is a €2 charge for that
ga: Má tá foilseán ann, mar shampla, deimhniú pósta, ar ceangal leis an gcáipéis nach mór a shíniú, gearrtar muirear €2 air sin

source: You are advised to check charges in advance
ga: Moltar duit na muirir a sheiceáil i dtosach báire

source: If you need a Commissioner for Oaths, you should contact a solicitor and find out whether they provides a Commissioner for Oaths service to the public
ga: Ba cheart duit teagmháil a dhéanamh le dlíodóir le fáil amach an gcuireann sé/sí seirbhís Choimisinéir Mionn ar fáil don phobal

source: If you want to be appointed as a Commissioner for Oaths you apply by Petition to the Chief Justice
ga: Más mian leat a bheith ceaptha mar Choimisinéir Mionnaí, a dhéanann tú ag Achainí chuig an bPríomh-Bhreitheamh

source: You must verify the Petition by Affidavit, accompanied by Certificates of Fitness signed by 6 members of the legal profession and by six leaders of the local business community
ga: Caithfidh tú an Achainí a fhíorú trí Mhionnscríbhinn, in éineacht le Deimhnithe Fitness sínithe ag 6 ball den ghairm dlí agus ag sé ceannairí den phobal gnó áitiúil
